/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   macro.cpp                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hnoguchi <hnoguchi@student.42tokyo.jp>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/04/20 11:29:52 by hnoguchi          #+#    #+#             */
/*   Updated: 2023/04/20 11:50:10 by hnoguchi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#if 0
「オブジェクト形式マクロ」は、const, enum に置き換える。名前空間に入れる。
「関数形式マクロ」は、関数テンプレートに置き換える。スコープを入れるなら名前空間を使用する。

#endif
