/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   Other.cpp                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hnoguchi <hnoguchi@student.42tokyo.jp>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/04/19 18:05:05 by hnoguchi          #+#    #+#             */
/*   Updated: 2023/04/19 18:11:47 by hnoguchi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#if 0

テンプレート仮引数と関数の仮引数

関数テンプレートと関数オーバーロード
関数テンプレートを関数オーバーロードすることは可能。
関数テンプレートと通常関数の関数オーバーロードも可能。

テンプレートの実装を記述する位置
関数宣言、定義ともにヘッダファイルに記述すること。

#endif
